artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 20
      name: "Warming up"
    - duration: 240
      arrivalRate: 20
      rampTo: 100
      name: "Ramping up"
    - duration: 360
      arrivalRate: 200
      name: "Sustained load"
  payload:
    path: "data/artillery.csv"
    fields:
      - "ip"
      - "token"
    order: sequence
    skipHeader: true
scenarios:
  - flow:
      - get:
          url: "/api/v1/ip/{{ ip }}?token={{ token }}&mode=artillery"